app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT "ideas".* FROM "ideas"

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("name", "description", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "railsgirls"], ["description", "develop an app"], ["picture", ""], ["created_at", "2018-08-18 01:56:24.863353"], ["updated_at", "2018-08-18 01:56:24.863353"]]

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]